app/Http/Controllers/User/AuthorizationController.php

update `users` set `email_verified` = 1, `users`.`updated_at` = '2023-10-21 05:01:56' where `id` = 3
delete from `user_authorizations` where `id` = 1
---
    public function mailVerify(Request $request,$token)
    {
        $request->merge(['token' => $token]);
        $request->validate([
            'token'     => "required|string|exists:user_authorizations,token",
            'code.*'      => "required|integer",
        ]);

        $code = implode("",$request->code);

        $otp_exp_sec = BasicSettingsProvider::get()->otp_exp_seconds ?? GlobalConst::DEFAULT_TOKEN_EXP_SEC;
        $auth_column = UserAuthorization::where("token",$request->token)->where("code",$code)->first();

        if(!$auth_column) return back()->with(['error' => ['invalid Token!']]);

        if($auth_column->created_at->addSeconds($otp_exp_sec) < now()) {
            $this->authLogout($request);
            return redirect()->route('user.login')->with(['error' => ['Session expired. Please try again']]);
        }
        dd(BasicSettingsProvider::get()->otp_exp_seconds);
        try{
            $auth_column->user->update([
                'email_verified'    => true,
            ]);
            $auth_column->delete();