app/Http/Controllers/User/DashboardController.php

select * from `currencies` where `status` = 1 and `sender` = 1 limit 1
select * from `currencies` where `status` = 1 and `receiver` = 1 limit 1
select count(*) as aggregate from `transactions`
select * from `transactions` where `user_id` = 3 order by `id` desc
select count(*) as aggregate from `transactions` where `status` = 6
select count(*) as aggregate from `transactions` where `status` = 7
select count(*) as aggregate from `transactions` where `status` = 2
select count(*) as aggregate from `transactions` where `status` = 3
select count(*) as aggregate from `transactions` where `status` = 5
select count(*) as aggregate from `transactions` where `status` = 1
select count(*) as aggregate from `transactions` where `status` = 4
select count(*) as aggregate from `transactions` where `status` = 8
select count(*) as aggregate from `transactions` where `status` = 9
select * from `transactions` where `user_id` = 3 order by `id` desc, `created_at` desc limit 3
---
    public function index()
    {
        $page_title              = "| Dashboard";
        $sender_currency         = Currency::where('status',true)->where('sender',true)->first();
        $receiver_currency       = Currency::where('status',true)->where('receiver',true)->first();

        $total_remittances       = Transaction::toBase()->count();
        $user_remittance         = Transaction::orderByDESC('id')->where('user_id',auth()->user()->id)->get();
        $total_amount            = $user_remittance->sum('request_amount');
        $complete                = Transaction::toBase()->where('status',global_const()::REMITTANCE_STATUS_COMPLETE)->count();
        $cancel                  = Transaction::toBase()->where('status',global_const()::REMITTANCE_STATUS_CANCEL)->count();

        //ongoing remittance
        $pending_log             = Transaction::toBase()->where('status',global_const()::REMITTANCE_STATUS_PENDING)->count();
        $progress_log            = Transaction::toBase()->where('status',global_const()::REMITTANCE_STATUS_CONFIRM_PAYMENT)->count();
        $settled_log             = Transaction::toBase()->where('status',global_const()::REMITTANCE_STATUS_SETTLED)->count();
        $under_review_log        = Transaction::toBase()->where('status',global_const()::REMITTANCE_STATUS_REVIEW_PAYMENT)->count();
        $hold_log                = Transaction::toBase()->where('status',global_const()::REMITTANCE_STATUS_HOLD)->count();
        $failed_log              = Transaction::toBase()->where('status',global_const()::REMITTANCE_STATUS_FAILED)->count();
        $refund_log              = Transaction::toBase()->where('status',global_const()::REMITTANCE_STATUS_REFUND)->count();

        $ongoing_remittance      = $pending_log + $progress_log + $under_review_log;
        $complete_remittance     = $settled_log + $refund_log + $complete;
        $cancel_remittance       = $cancel + $hold_log;

        $transactions = Transaction::orderByDESC('id')->where('user_id',auth()->user()->id)->latest()->take(3)->get();

select count(*) as aggregate from `transactions` where `user_id` = 3 and `type` = 'SEND-REMITTANCE' and `status` = 2 and date(`created_at`) = '2023-10-01'
select count(*) as aggregate from `transactions` where `user_id` = 3 and `type` = 'SEND-REMITTANCE' and date(`created_at`) = '2023-10-01' and `status` = 6
---
        while ($start <= $end) {
            $start_date = date('Y-m-d', $start);
            // Monthley add money
            $pending = Transaction::where('user_id',auth()->user()->id)->where('type', PaymentGatewayConst::TYPESENDREMITTANCE)->where('status', 2)->whereDate('created_at',$start_date)->count();
            $complete = Transaction::where('user_id',auth()->user()->id)->where('type', PaymentGatewayConst::TYPESENDREMITTANCE)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', global_const()::REMITTANCE_STATUS_COMPLETE)
                                        ->count();

select * from `user_notifications` where `user_id` = 3 order by `created_at` desc limit 10
---
        $client_ip = request()->ip() ?? false;
        $user_country = geoip()->getLocation($client_ip)['country'] ?? "";
        $user         = auth::user();
        $notifications = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();