app/Http/Controllers/User/ProfileController.php

select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 10
---
    public function index()
    {
        $page_title    = "| User Profile";
        $client_ip     = request()->ip() ?? false;
        $user_country  = geoip()->getLocation($client_ip)['country'] ?? "";
        $kyc_data      = SetupKyc::userKyc()->first();
        $user          = auth::user();
        $notifications = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();