app/Http/Controllers/User/RecipientController.php

    public function index(Request $request,$identifier){

        $page_title           = "| Recipients";
        $temporary_data       = TemporaryData::where('identifier',$identifier)->first();
        $recipients           = Recipient::where('method',$temporary_data->type)->where('user_id',auth()->user()->id)->orderByDESC('id')->get();
        $client_ip            = request()->ip() ?? false;
        $user_country         = geoip()->getLocation($client_ip)['country'] ?? "";
        $user                 = auth()->user();
        $notifications        = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();
---
select * from `temporary_datas` where `identifier` = '12d50e90-37c8-44b8-82cb-fda079ed58d6' limit 1
select * from `recipients` where `method` = 'Bank Transfer' and `user_id` = 1 order by `id` desc
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 10

    public function add(Request $request,$identifier){
        $page_title           = "| Add Recipient";
        $temporary_data       = TemporaryData::where('identifier',$identifier)->first();
        $client_ip            = request()->ip() ?? false;
        $user_country         = geoip()->getLocation($client_ip)['country'] ?? "";
        $user                 = auth()->user();
        $notifications        = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();
        $sender_currency      = Currency::where('status',true)->where('sender',true)->first();
        $receiver_currency    = Currency::where('status',true)->where('receiver',true)->first();
        $receiver_country     = Currency::where('receiver',true)->first();
        $banks                = RemittanceBank::where('country',$receiver_country->country)->where('status',true)->get();
        $mobile_methods       = MobileMethod::where('country',$receiver_country->country)->where('status',true)->get();
---
select * from `temporary_datas` where `identifier` = '994a1f7c-1cc3-4359-a375-777f0a26113a' limit 1
select * from `user_notifications` where `user_id` = 3 order by `created_at` desc limit 10
select * from `currencies` where `status` = 1 and `sender` = 1 limit 1
select * from `currencies` where `status` = 1 and `receiver` = 1 limit 1
select * from `currencies` where `receiver` = 1 limit 1
select * from `remittance_banks` where `country` = 'Nigeria' and `status` = 1
select * from `mobile_methods` where `country` = 'Nigeria' and `status` = 1

    public function store(Request $request,$identifier){
        $temporary_data       = TemporaryData::where('identifier',$identifier)->first();
        if($request->method == global_const()::RECIPIENT_METHOD_BANK ){

            $validator      = Validator::make($request->all(),[
                'first_name'      => 'required|string',
                'middle_name'     => 'nullable|string',
                'last_name'       => 'required|string',
                'email'           => 'nullable|email',
                'country'         => 'nullable|string',
                'city'            => 'nullable|string',
                'state'           => 'nullable|string',
                'zip_code'        => 'nullable|string',
                'phone'           => 'nullable|string',
                'method'          => 'required|string',
                'bank_name'       => 'required|string',
                'iban_number'     => 'required|string',
                'address'         => 'nullable|string',
                'document_type'   => 'nullable|string',
                'front_image'     => 'nullable|image|mimes:png,jpg,webp,jpeg,svg',
                'back_image'      => 'nullable|image|mimes:png,jpg,webp,jpeg,svg',
            ]);
            if($validator->fails()){
                return back()->withErrors($validator)->withInput($request->all());
            }
            $validated   = $validator->validate();
            if($request->hasFile('front_image') || $request->hasFile('back_image')){
                $validated['front_image'] = $this->imageValidate($request,"front_image",null);
                $validated['back_image'] = $this->imageValidate($request,"back_image",null);
            }
            if(Recipient::where('user_id',auth()->user()->id)->where('email',$validated['email'])->where('method',$validated['method'])->where('bank_name',$validated['bank_name'])->exists()){
---
select * from `temporary_datas` where `identifier` = 'b0352ae9-45a5-4242-b433-617fb30305df' limit 1
select exists(select * from `recipients` where `user_id` = 1 and `email` = 'witodelywe@mailinator.com' and `method` = 'Bank' and `bank_name` = 'Union Bank of Nigeria Plc') as `exists`

            $validated['user_id'] = auth()->user()->id;
            $validated['method'] = "Bank Transfer";
            try{
                Recipient::create($validated);
---
insert into `recipients` (`first_name`, `middle_name`, `last_name`, `email`, `country`, `city`, `state`, `zip_code`, `phone`, `method`, `bank_name`, `iban_number`, `address`, `user_id`, `updated_at`, `created_at`) values ('Ayanna', 'Bernard Bowman', 'Santana', 'witodelywe@mailinator.com', 'Nigeria', 'Non labore duis dolo', 'Eos sunt quis est', '27215', '56', 'Bank Transfer', 'Union Bank of Nigeria Plc', '336', 'Maxime ab lorem sed', 1, '2023-10-22 10:18:56', '2023-10-22 10:18:56')

    public function send(Request $request,$identifier){
        $recipient = Recipient::where('id',$request->id)->first();

        if(!$recipient){
            return back()->with(['error' => ['Please select a recipient']]);
        }
        $temporary_data = TemporaryData::where('identifier',$identifier)->first();
---
select * from `recipients` where `id` is null limit 1
select * from `temporary_datas` where `identifier` = '67511bef-cb61-4bb5-81cc-4ecd20cbff23' limit 1

    public function show(){
        $page_title           = "| Recipients";
        $recipients           = Recipient::where('user_id',auth()->user()->id)->orderByDESC('id')->paginate(10);
        $client_ip            = request()->ip() ?? false;
        $user_country         = geoip()->getLocation($client_ip)['country'] ?? "";
        $user                 = auth()->user();
        $notifications        = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();
---
select count(*) as aggregate from `recipients` where `user_id` = 1
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 10