app/Http/Controllers/User/RemittanceController.php

    public function success(Request $request, $gateway){
        $requestData = $request->all();
        $token = $requestData['token'] ?? "";
        $checkTempData = TemporaryData::where("type",$gateway)->where("identifier",$token)->first();
---
select * from `temporary_datas` where `type` = 'paypal' and `identifier` = '5P1847798M823654Y' limit 1

    public function stripePaymentSuccess($trx){

        $token = $trx;
        $checkTempData = TemporaryData::where("type",PaymentGatewayConst::STRIPE)->where("identifier",$token)->first();
---
select * from `temporary_datas` where `type` = 'stripe' and `identifier` = 'TXREF_1697705290' limit 1

    public function manualPayment(){
        $tempData       = Session::get('identifier');
        $hasData        = TemporaryData::where('identifier', $tempData)->first();
        $gateway        = PaymentGateway::manual()->where('slug',PaymentGatewayConst::remittance_money_slug())->where('id',$hasData->data->gateway)->first();

        $page_title     = "Manual Payment".' ( '.$gateway->name.' )';
        $client_ip      = request()->ip() ?? false;
        $user_country   = geoip()->getLocation($client_ip)['country'] ?? "";
        $kyc_data       = SetupKyc::userKyc()->first();
        $user           = auth()->user();
        $notifications  = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();
---
select * from `temporary_datas` where `identifier` = 'utliAeGbCKQCKXCt' limit 1
select * from `payment_gateways` where (`type` = 'MANUAL') and `slug` = 'remittance-gateway' and `id` = 6 limit 1
select * from `user_notifications` where `user_id` = 3 order by `created_at` desc limit 10

    public function paymentConfirmation(Request $request,$trx_id){
        $page_title    = "| Payment Confirmation";
        $client_ip     = request()->ip() ?? false;
        $user_country  = geoip()->getLocation($client_ip)['country'] ?? "";
        $kyc_data      = SetupKyc::userKyc()->first();
        $user          = auth()->user();
        $notifications = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();
        $transaction   = Transaction::where('trx_id',$trx_id)->first();
---
select * from `user_notifications` where `user_id` = 3 order by `created_at` desc limit 10
select * from `transactions` where `trx_id` = 'R76797238' limit 1