app/Http/Controllers/User/SendRemittanceController.php

select * from `transaction_settings` where `status` = 1
select * from `currencies` where `status` = 1 and `sender` = 1
select * from `currencies` where `status` = 1 and `receiver` = 1
select * from `currencies` where `status` = 1 and `sender` = 1 limit 1
select * from `currencies` where `status` = 1 and `receiver` = 1 limit 1
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 10
---
    public function index(){
        $page_title                 = "| Send Remittance";
        $transaction_settings       = TransactionSetting::where('status',true)->get();
        $sender_currency            = Currency::where('status',true)->where('sender',true)->get();
        $receiver_currency          = Currency::where('status',true)->where('receiver',true)->get();
        $sender_currency_first      = Currency::where('status',true)->where('sender',true)->first();
        $receiver_currency_first    = Currency::where('status',true)->where('receiver',true)->first();
        $client_ip                  = request()->ip() ?? false;
        $user_country               = geoip()->getLocation($client_ip)['country'] ?? "";
        $user                       = auth()->user();
        $notifications              = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();

insert into `temporary_datas` (`type`, `identifier`, `data`, `updated_at`, `created_at`) values ('Bank Transfer', '\"7dab7f78-e291-4a33-b8b7-85043c5d9426\"', '{\"send_money\":\"7\",\"fees\":\"1.50\",\"convert_amount\":\"7.00\",\"payable_amount\":\"8.50\",\"receive_money\":\"567.51\",\"sender_name\":\"Test User\",\"sender_email\":\"user@appdevs.net\",\"sender_currency\":\"CAD\",\"receiver_currency\":\"BDT\",\"sender_ex_rate\":\"1.00\",\"sender_base_rate\":\"1.36\",\"receiver_ex_rate\":\"81.07\"}', '2023-10-21 09:10:56', '2023-10-21 09:10:56')
---

        ];
        try {
            $temporary_data = TemporaryData::create($data);

select * from `temporary_datas` where `identifier` = '405858a1-43bb-44fb-99ac-f6836ca4654c' limit 1
select * from `sending_purposes` where `status` = 1
select * from `source_of_funds` where `status` = 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'remittance-gateway' and `status` = 1)
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 10
---
    public function receiptPayment($identifier){
        $page_title        = "| Receipt Payment";
        $temporary_data    = TemporaryData::where('identifier',$identifier)->first();
        $sending_purposes  = SendingPurpose::where('status',true)->get();
        $source_of_funds   = SourceOfFund::where('status',true)->get();
        $payment_gateway   = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::remittance_money_slug());
            $gateway->where('status', 1);
        })->get();
        $client_ip         = request()->ip() ?? false;
        $user_country      = geoip()->getLocation($client_ip)['country'] ?? "";
        $user              = auth()->user();
        $notifications     = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();

select * from `temporary_datas` where `identifier` = 'c5929563-a1f7-4535-b63e-fffb03a434a5' limit 1
select * from `payment_gateway_currencies` where `id` = '1' limit 1
select * from `source_of_funds` where `id` = '4' limit 1
select * from `sending_purposes` where `id` = '4' limit 1
---
    public function receipantPaymentStore(Request $request,$identifier){
        $temporary_data          = TemporaryData::where('identifier',$identifier)->first();
        $validator               = Validator::make($request->all(),[
            'sending_purpose'    => 'required|integer',
            'source'             => 'required|integer',
            'remark'             => 'nullable|string',
            'payment_gateway'    => 'required|integer',
        ]);
        if($validator->fails()){
            return back()->withErrors($validator)->withInput($request->all());
        }
        $validated   = $validator->validate();
        $currency = PaymentGatewayCurrency::where('id',$validated['payment_gateway'])->first();
        $source_of_fund = SourceOfFund::where('id',$validated['source'])->first();
        $sending_purpose  = SendingPurpose::where('id',$validated['sending_purpose'])->first();

select * from `currencies` where `status` = 1 and `sender` = 1 limit 1
select * from `currencies` where `status` = 1 and `receiver` = 1 limit 1
select * from `temporary_datas` where `identifier` = 'a610f1a3-9a6a-4ae5-8275-e0ea95b0b679' limit 1
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 10
---
    public function receiptPreview($identifier){
        $page_title           = "| Receipt Preview";
        $sender_currency      = Currency::where('status',true)->where('sender',true)->first();
        $receiver_currency    = Currency::where('status',true)->where('receiver',true)->first();
        $temporary_data       = TemporaryData::where('identifier',$identifier)->first();
        $client_ip            = request()->ip() ?? false;
        $user_country         = geoip()->getLocation($client_ip)['country'] ?? "";
        $user                 = auth()->user();
        $notifications        = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();