app/Http/Controllers/User/TransactionController.php

    public function transaction(){
        $page_title           = "| Transactions";
        $transactions         = Transaction::where('user_id',auth()->user()->id)->orderByDESC('id')->get();
        $sender_currency      = Currency::where('status',true)->where('sender',true)->first();
        $receiver_currency    = Currency::where('status',true)->where('receiver',true)->first();

        $client_ip            = request()->ip() ?? false;
        $user_country         = geoip()->getLocation($client_ip)['country'] ?? "";
        $user                 = auth()->user();
        $notifications        = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();
---
select * from `transactions` where `user_id` = 1 order by `id` desc
select * from `currencies` where `status` = 1 and `sender` = 1 limit 1
select * from `currencies` where `status` = 1 and `receiver` = 1 limit 1
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 10