app/Http/Helpers/PaymentGateway.php

select * from `temporary_datas` where `identifier` = 'd7848b54-60ee-422b-8022-2174e8c5c237' limit 1
select * from `payment_gateway_currencies` where `alias` = 'remittance-gateway-paypal-aud-automatic' limit 1
---
    public function gateway() {
        $request_data = $this->request_data;

        if(empty($request_data)) throw new Exception("Gateway Information is not available. Please provide payment gateway currency alias");
        $validated = $this->validator($request_data)->validate();
        $temporary_data = TemporaryData::where('identifier',$request_data['identifier'])->first();
        $gateway_currency = PaymentGatewayCurrency::where("alias",$temporary_data->data->currency->alias)->first();

select * from `temporary_datas` where `identifier` = 'd7848b54-60ee-422b-8022-2174e8c5c237' limit 1
---
    public function chargeCalculate($currency,$receiver_currency = null) {
        $temporary_data = TemporaryData::where('identifier',$this->request_data['identifier'])->first();

select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`id` = 1 limit 1
---
    public function responseReceive($type = null) {

        $tempData = $this->request_data;
        if(empty($tempData) || empty($tempData['type'])) throw new Exception('Transaction faild. Record didn\'t saved properly. Please try again.');

        $method_name = $tempData['type']."Success";


        if($this->requestIsApiUser()) {

            $creator_table = $tempData['data']->creator_table ?? null;
            $creator_id = $tempData['data']->creator_id ?? null;

            $creator_guard = $tempData['data']->creator_guard ?? null;
            $api_authenticated_guards = PaymentGatewayConst::apiAuthenticateGuard();
            if(!array_key_exists($creator_guard,$api_authenticated_guards)) throw new Exception('Request user doesn\'t save properly. Please try again');

            if($creator_table == null || $creator_id == null || $creator_guard == null) throw new Exception('Request user doesn\'t save properly. Please try again');
            $creator = DB::table($creator_table)->where("id",$creator_id)->first();
            if(!$creator) throw new Exception("Request user doesn\'t save properly. Please try again");
            $api_user_login_guard = $api_authenticated_guards[$creator_guard];
            $this->output['api_login_guard'] = $api_user_login_guard;
            Auth::guard($api_user_login_guard)->loginUsingId($creator->id);
        }
        $currency_id = $tempData['data']->currency ?? "";

        $gateway_currency = PaymentGatewayCurrency::find($currency_id);

select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`id` = 1 limit 1
---
    public function responseReceiveApi($type = null) {
        $tempData = $this->request_data;


        if(empty($tempData) || empty($tempData['type'])){

            return Response::error(['Transaction faild. Record didn\'t saved properly. Please try again.']);
        }
        $method_name = $tempData['type']."Success";
        if($this->requestIsApiUser()) {
            $creator_table = $tempData['data']->creator_table ?? null;
            $creator_id = $tempData['data']->creator_id ?? null;
            $creator_guard = $tempData['data']->creator_guard ?? null;
            $api_authenticated_guards = PaymentGatewayConst::apiAuthenticateGuard();
            if($creator_table != null && $creator_id != null && $creator_guard != null) {
                if(!array_key_exists($creator_guard,$api_authenticated_guards)) throw new Exception('Request user doesn\'t save properly. Please try again');
                $creator = DB::table($creator_table)->where("id",$creator_id)->first();
                if(!$creator) throw new Exception("Request user doesn\'t save properly. Please try again");
                $api_user_login_guard = $api_authenticated_guards[$creator_guard];
                $this->output['api_login_guard'] = $api_user_login_guard;
                Auth::guard($api_user_login_guard)->loginUsingId($creator->id);
            }
        }




        $currency_id = $tempData['data']->currency ?? "";
        $gateway_currency = PaymentGatewayCurrency::find($currency_id);