app/Notifications/paypalNotification.php

select * from `temporary_datas` where `identifier` = 'd7848b54-60ee-422b-8022-2174e8c5c237' limit 1
select * from `currencies` where `status` = 1 and `receiver` = 1 limit 1
---
    public function toMail($notifiable)
    {
        $user = $this->user;
        $data = $this->data;
        $identifier_data = TemporaryData::where('identifier',$data['tempData']['data']->user_record)->first();
        $trx_id = $this->trx_id;
        $date = Carbon::now();
        $datetime = dateFormat('Y-m-d h:i:s A', $date);
        $basic_settings = BasicSettingsProvider::get();
        $contact_section_slug = Str::slug(SiteSectionConst::CONTACT_SECTION);
        $contact              = SiteSections::getData($contact_section_slug)->first();

        $receiver_currency    = Currency::where('status',true)->where('receiver',true)->first();