app/Http/Controllers/Api/V1/User/SendRemittanceController.php

select * from `transaction_settings` where `status` = 1 and `title` like '%Bank Transfer%' limit 1
select * from `currencies` where `status` = 1 and `sender` = 1 and `id` = '2' limit 1
select * from `currencies` where `status` = 1 and `receiver` = 1 and `id` = '18' limit 1
---
    public function store(Request $request){
        $validator              = Validator::make($request->all(),[
            'type'              => 'required',
            'send_money'        => 'required',
            'sender_currency'   => 'required',
            'receiver_currency' => 'required',
        ]);
        if($validator->fails()){
            return Response::error($validator->errors()->all(),[]);
        }
        $validated            = $validator->validate();
        $transaction_type     = TransactionSetting::where('status',true)->where('title','like','%'.$request->type.'%')->first();
        $sender_currency        = Currency::where('status',true)->where('sender',true)->where('id',$request->sender_currency)->first();
        $receiver_currency    = Currency::where('status',true)->where('receiver',true)->where('id',$request->receiver_currency)->first();

select * from `temporary_datas` where `identifier` = '689b8723-3ea3-4c95-9822-66cb5843b630' limit 1
select * from `recipients` where `method` = 'Bank Transfer' and `user_id` = 1 order by `id` asc
---
    public function beneficiary(Request $request){
        $validator  = Validator::make($request->all(),[
            'identifier'  => 'required',
        ]);

        if($validator->fails()) return Response::error($validator->errors()->all(),[]);
        $temporary_data    = TemporaryData::where('identifier',$request->identifier)->first();
        $beneficiaries     = Recipient::where('method',$temporary_data->type)->where('user_id',auth()->user()->id)->orderBy('id')->get();

select * from `temporary_datas` where `identifier` = 'ac28bb80-d7bd-462e-bdfd-099b58703823' limit 1
select * from `payment_gateway_currencies` where `alias` = 'remittance-gateway-flutter-wave-ngn-automatic' and exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'remittance-gateway' and `status` = 1) limit 1
select * from `temporary_datas` where `identifier` = 'TXREF_1697884086' limit 1
---
    public function submitData(Request $request) {

        $validator = Validator::make($request->all(), [
           'identifier'  => "required",
       ]);

       if($validator->fails()){
           $error =  ['error'=>$validator->errors()->all()];
           return Response::validation($error);
       }

       $temporary_data  = TemporaryData::where('identifier',$request->identifier)->first();
       $alias = $temporary_data->data->currency->alias;
       $amount = $temporary_data->data->payable_amount * $temporary_data->data->currency->rate;

       $payment_gateways_currencies = PaymentGatewayCurrency::where('alias',$alias)->whereHas('gateway', function ($gateway) {
           $gateway->where('slug', PaymentGatewayConst::remittance_money_slug());
           $gateway->where('status', 1);
        })->first();

       if(!$payment_gateways_currencies){
            $error = ['error'=>['Gateway Information is not available. Please provide payment gateway currency alias']];
            return Response::error($error);
       }
       $user = auth()->user();
       try{
           $instance = PaymentGatewayHelper::init($request->all())->gateway()->api()->get();
           $trx = $instance['response']['id']??$instance['response']['trx'];
            $temData = TemporaryData::where('identifier',$trx)->first();

select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (5) order by `id` desc
select * from `payment_gateways` where `id` = 5 limit 1
---
               $error = ['error'=>["Invalid Request"]];
               return Response::error($error);
           }
           $payment_gateway_currency = PaymentGatewayCurrency::where('id', $temData->data->currency)->first();
           $payment_gateway = PaymentGateway::where('id', $temData->data->gateway)->first();

select * from `temporary_datas` where `type` = 'paypal' and `identifier` = '4UW60111EK418984H' limit 1
---
   public function success(Request $request, $gateway){
       $requestData = $request->all();
       $token = $requestData['token'] ?? "";
       $checkTempData = TemporaryData::where("type", $gateway)->where("identifier", $token)->first();

select * from `temporary_datas` where `type` = 'stripe' and `identifier` = 'TXREF_1697883199' limit 1
---
   public function flutterwaveCallback(){

    $status = request()->status;

    if ($status ==  'successful'){

        $transactionID = Flutterwave::getTransactionIDFromCallback();
        $data = Flutterwave::verifyTransaction($transactionID);

        $requestData = request()->tx_ref;

        $token = $requestData;

        $checkTempData = TemporaryData::where("type",'flutterwave')->where("identifier",$token)->first();