app/Traits/PaymentGateway/Paypal.php

    public function paypalSuccess($output = null) {
        if(!$output) $output = $this->output;
        $token = $this->output['tempData']['identifier'] ?? "";
        $user_data = TemporaryData::where('identifier',$output['tempData']['data']->user_record ?? "")->first();
---
select * from `temporary_datas` where `identifier` = 'd7848b54-60ee-422b-8022-2174e8c5c237' limit 1

    public function paypalPaymentCaptured($response,$output) {
        // payment successfully captured record saved to database
        $output['capture'] = $response;
        try{
            $trx_id = generateTrxString('transactions', 'trx_id', 'R', 8);
            $basic_settings = BasicSettingsProvider::get();
            $user = auth()->user();

            // Notification::route("mail",$user->email)->notify(new paypalNotification($user,$output,$trx_id));

            if(auth()->check()){
                UserNotification::create([
                    'user_id'  => auth()->user()->id,
                    'message'  => "Your Remittance  (Payable amount: ".get_amount($output['amount']->total_amount + $output['amount']->total_charge).",
                    Get Amount: ".get_amount($output['amount']->will_get).") Successfully Sended.",
                ]);
---
insert into `user_notifications` (`user_id`, `message`, `updated_at`, `created_at`) values (1, '\"Your Remittance  (Payable amount: 18.34,\r\n                    Get Amount: 7,648.30) Successfully Sended.\"', '2023-10-19 11:52:41', '2023-10-19 11:52:41')

    public function removeTempData($output) {
        $token = $output['capture']['id'];
        TemporaryData::where("identifier",$token)->delete();
---
delete from `temporary_datas` where `identifier` = '5P1847798M823654Y'