app/Traits/PaymentGateway/Stripe.php

    public function createTransactionStripe($output) {
        $basic_setting = BasicSettings::first();
---
select * from `basic_settings` limit 1

    public function insertRecordStripe($output, $trx_id) {

        $trx_id = $trx_id;
        $token = $this->output['tempData']['identifier'] ?? "";

        $user_data = TemporaryData::where('identifier',$output['request_data']['identifier'] )->first();
---
select * from `temporary_datas` where `identifier` = '929f22e3-ba19-455e-b787-db3be3cccc55' limit 1

    public function removeTempDataStripe($output) {
        $token = session()->get('identifier');
        TemporaryData::where("identifier",$token)->delete();
---
delete from `temporary_datas` where `identifier` is null