app/Http/Controllers/User/Auth/LoginController.php

select * from `useful_links` where `status` = 1
---
    public function showLoginForm() {
        $page_title           = "| User Login";
        $footer_section_slug  = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer               = SiteSections::getData($footer_section_slug)->first();
        $subscribe_slug       = Str::slug(SiteSectionConst::SUBSCRIBE_SECTION);
        $subscribe            = SiteSections::getData($subscribe_slug)->first();
        $useful_link          = UsefulLink::where('status',true)->get();