app/Models/Admin/Currency.php

select * from `currencies` where `default` = 1 limit 1
---
    public function scopeDefault() {
        return $this->where('default',true)->first() ?? false;