app/Http/Controllers/Frontend/SiteController.php

select * from `transaction_settings` where `status` = 1
select * from `currencies` where `status` = 1 and `sender` = 1 limit 1
select * from `currencies` where `status` = 1 and `receiver` = 1 limit 1
select * from `site_sections` where `key` = 'testimonial-section' limit 1
select * from `journals` where `status` = 1
select * from `useful_links` where `status` = 1
---
    public function index(){
        $transaction_settings       = TransactionSetting::where('status',true)->get();
        $sender_currency            = Currency::where('status',true)->where('sender',true)->get();
        $receiver_currency          = Currency::where('status',true)->where('receiver',true)->get();
        $sender_currency_first      = Currency::where('status',true)->where('sender',true)->first();
        $receiver_currency_first    = Currency::where('status',true)->where('receiver',true)->first();
        $default_currency           = Currency::where('status',true)->where('default',true)->first();
        $banner_section_slug        = Str::slug(SiteSectionConst::BANNER_SECTION);
        $banner                     = SiteSections::getData($banner_section_slug)->first();
        $country_section            = CountrySection::where('key',SiteSectionConst::COUNTRY_SECTION)->first();
        $feature_section_slug       = Str::slug(SiteSectionConst::FEATURE_SECTION);
        $feature                    = SiteSections::getData($feature_section_slug)->first();
        $how_its_work_slug          = Str::slug(SiteSectionConst::HOW_ITS_WORK_SECTION);
        $how_its_work               = SiteSections::getData($how_its_work_slug)->first();
        $testimonial_slug           = Str::slug(SiteSectionConst::TESTIMONIAL_SECTION);
        $testimonial                = SiteSections::getData($testimonial_slug)->first();
        $choose_section_slug        = Str::slug(SiteSectionConst::CHOOSE_US_SECTION);
        $choose                     = SiteSections::getData($choose_section_slug)->first();
        $app_download_slug          = Str::slug(SiteSectionConst::APP_DOWNLOAD_SECTION);
        $app_download               = SiteSections::getData($app_download_slug)->first();
        $journal_section_slug       = Str::slug(SiteSectionConst::JOURNAL_SECTION);
        $journal_section            = SiteSections::getData($journal_section_slug)->first();
        $journals                   = Journal::where('status',true)->get();
        $brand_section_slug         = Str::slug(SiteSectionConst::BRAND_SECTION);
        $brand                      = SiteSections::getData($brand_section_slug)->first();
        $footer_section_slug        = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                     = SiteSections::getData($footer_section_slug)->first();
        $subscribe_slug             = Str::slug(SiteSectionConst::SUBSCRIBE_SECTION);
        $subscribe                  = SiteSections::getData($subscribe_slug)->first();
        $useful_link                = UsefulLink::where('status',true)->get();

select * from `journals` where `status` = 1
select * from `useful_links` where `status` = 1
---
    public function webJournal(){
        $page_title           = "| Web Journal Page";
        $journal_section_slug = Str::slug(SiteSectionConst::JOURNAL_SECTION);
        $journal_section      = SiteSections::getData($journal_section_slug)->first();
        $journals             = Journal::where('status',true)->get();

        $footer_section_slug  = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer               = SiteSections::getData($footer_section_slug)->first();
        $subscribe_slug       = Str::slug(SiteSectionConst::SUBSCRIBE_SECTION);
        $subscribe            = SiteSections::getData($subscribe_slug)->first();
        $useful_link          = UsefulLink::where('status',true)->get();

select * from `journals` where `slug` = 'take-pride-in-offering-excellent-customer-service' limit 1
select * from `journals` where `status` = 1 and `slug` != 'take-pride-in-offering-excellent-customer-service'
select * from `useful_links` where `status` = 1
---
    public function journalDetails($slug){
        $page_title           = "| Journal Details";
        $journal              = Journal::where('slug',$slug)->first();
        if(!$journal) abort(404);
        $category             = WebJournalCategory::withCount('journals')->get();
        $recent_posts         = Journal::where('status',true)->where('slug', '!=',$slug)->get();
        $contact_section_slug = Str::slug(SiteSectionConst::CONTACT_SECTION);
        $contact              = SiteSections::getData($contact_section_slug)->first();
        $footer_section_slug  = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer               = SiteSections::getData($footer_section_slug)->first();
        $subscribe_slug       = Str::slug(SiteSectionConst::SUBSCRIBE_SECTION);
        $subscribe            = SiteSections::getData($subscribe_slug)->first();
        $useful_link          = UsefulLink::where('status',true)->get();