app/Http/Controllers/GlobalController.php

    public function languageSwitch(Request $request) {
        $code = $request->target;
        $language = Language::where("code",$code)->first();
---
select * from `languages` where `code` = 'ar' limit 1