app/Http/Controllers/Admin/CurrencyController.php

update `currencies` set `default` = 0, `currencies`.`updated_at` = '2023-10-18 05:19:45' where `default` = 1
---
        $validated = replace_array_key($validated,"currency_");

        try{
            $currency->update($validated);