app/Http/Controllers/Admin/CurrencyController.php

        $validated = replace_array_key($validated,"currency_");

        try{
            $currency->update($validated);
---
update `currencies` set `flag` = '679ebfbc-4782-46ac-b497-dae026ca4970.webp', `currencies`.`updated_at` = '2023-10-19 05:11:35' where `id` = 3

    public function delete(Request $request) {
        $validator = Validator::make($request->all(),[
            'target'        => 'required|string|exists:currencies,code',
        ]);
        $validated = $validator->validate();
        $currency = Currency::where("code",$validated['target'])->first();

        if($currency->isDefault()) {
            return back()->with(['warning' => ['Can\'t deletable default currency.']]);
        }

        try{
            $currency->delete();
---
select * from `currencies` where `code` = 'BDT' limit 1
delete from `currencies` where `id` = 4