app/Http/Controllers/Admin/CurrencyController.php

select * from `currencies` order by `default` desc limit 10 offset 0
select count(*) as aggregate from `currencies`
---
    public function index()
    {
        $page_title = "Setup Currency";
        $currencies = Currency::orderByDesc('default')->paginate(10);

select count(*) as aggregate from `currencies` where `default` = 1
---
        // If Default is already available
        if($default[$validated['option']] == true) {
            $check_default = Currency::where('default',true);
            if($check_default->count() > 0) {

insert into `currencies` (`type`, `country`, `name`, `code`, `symbol`, `rate`, `sender`, `receiver`, `default`, `created_at`, `admin_id`, `updated_at`) values ('FIAT', 'Australia', 'Australian dollar', 'AUD', '$', '1.5', 0, 1, 1, '2023-10-18 05:19:45', 1, '2023-10-18 05:19:45')
---
        $validated = Arr::except($validated,['role','flag','option']);
        // insert_data
        try{
            $currency = Currency::create($validated);

select * from `currencies` where `code` = 'USD' limit 1
update `currencies` set `status` = 1, `currencies`.`updated_at` = '2023-10-18 05:18:04' where `id` = 1
---
    public function statusUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'status'                    => 'required|boolean',
            'data_target'               => 'required|string',
        ]);
        if ($validator->stopOnFirstFailure()->fails()) {
            $error = ['error' => $validator->errors()];
            return Response::error($error,null,400);
        }
        $validated = $validator->safe()->all();
        $currency_code = $validated['data_target'];

        $currency = Currency::where('code',$currency_code)->first();
        if(!$currency) {
            $error = ['error' => ['Currency record not found in our system.']];
            return Response::error($error,null,404);
        }

        try{
            $currency->update([
                'status' => ($validated['status'] == true) ? false : true,
            ]);

select * from `currencies` where `code` = 'GBP' limit 1
---
    public function update(Request $request)
    {
        $target = $request->target ?? $request->currency_code;
        $currency = Currency::where('code',$target)->first();

select * from `currencies` where `code` = 'AUD' limit 1
delete from `currencies` where `id` = 5
---
    public function delete(Request $request) {
        $validator = Validator::make($request->all(),[
            'target'        => 'required|string|exists:currencies,code',
        ]);
        $validated = $validator->validate();
        $currency = Currency::where("code",$validated['target'])->first();

        if($currency->isDefault()) {
            return back()->with(['warning' => ['Can\'t deletable default currency.']]);
        }

        try{
            $currency->delete();