app/Http/Controllers/Admin/JournalController.php

    public function journalEdit($id){
        $journals     = Journal::find($id);
        if(!$journals) return back()->with(['error' => ['Journal Does not exists']]);
        $page_title   = "Journal Edit Page";
        $category   = WebJournalCategory::where('status',true)->get();
        $languages    = Language::get();
---
select * from `journals` where `journals`.`id` = '3' limit 1
select * from `web_journal_categories` where `status` = 1
select * from `languages`

    public function journalUpdate(Request $request,$id){
        $journal            = Journal::find($id);
---
select * from `journals` where `journals`.`id` = '3' limit 1

    public function contentValidate($request,$basic_field_name,$modal = null) {
        $languages = Language::get();
---
select * from `languages`