app/Http/Controllers/Admin/SetupSectionsController.php

    public function __construct()
    {
        $this->languages =  Language::get();
---
select * from `languages`

    public function bannerUpdate(Request $request,$slug) {
        $basic_field_name = [
            'heading' => "required|string|max:100",
            'sub_heading' => "required|string|max:1000",
            'button_name' => "required|string|max:50",
            'video_link' => "required|url|max:255"
        ];

        $slug = Str::slug(SiteSectionConst::BANNER_SECTION);
        $section = SiteSections::where("key",$slug)->first();
        if($section != null){
            $data         = json_decode(json_encode($section->value),true);
        }else{
            $data         = [];
        }
        $data['image']    = $section->value->image ?? "";

        if($request->hasFile("image")) {
            $data['image']      = $this->imageValidate($request,"image",$section->value->image ?? null);
        }

        $data['language']  = $this->contentValidate($request,$basic_field_name);
        $update_data['value']  = $data;
        $update_data['key']    = $slug;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'banner-section' limit 1
select * from `site_sections` where (`key` = 'banner-section') limit 1

    public function chooseUpdate(Request $request){
        $basic_field_name = [
            'title'       => 'required|string|max:100',
            'heading'     => 'required|string|max:100',
            'sub_heading' => 'required|string',
            'button_name' => 'required|string',
            'video_link'  => 'required|url',
        ];

        $slug             = Str::slug(SiteSectionConst::CHOOSE_US_SECTION);
        $section          = SiteSections::where("key",$slug)->first();
        if($section != null){
            $data         = json_decode(json_encode($section->value),true);
        }else{
            $data         = [];
        }
        $data['image']    = $section->value->image ?? "";
        $data['video_link'] = $request->video_link;
        $data['button_name'] = $request->button_name;
        if($request->hasFile("image")){
            $data['image'] = $this->imageValidate($request,"image",$section->value->image ?? null);
        }
        $data['language']  = $this->contentValidate($request,$basic_field_name);
        $update_data['key'] = $slug;
        $update_data['value'] = $data;
        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'how-its-work-section' limit 1

    public function featureItemUpdate(Request $request,$slug){
        $request->validate([
            'target'           => 'required|string',
        ]);

        $basic_field_name      = [
            'item_title_edit'     => "required|string|max:100",
            'description_edit'     => "required|string",
        ];



        $slug    = Str::slug(SiteSectionConst::FEATURE_SECTION);
        $section = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => ['Section item not found!']]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);
---
select * from `site_sections` where `key` = 'feature-section' limit 1

    public function journalView($slug){
        $page_title       = "Journal Section";
        $section_slug     = Str::slug(SiteSectionConst::JOURNAL_SECTION);
        $data             = SiteSections::getData($section_slug)->first();
        $languages        = $this->languages;
        $category         = WebJournalCategory::get();
        $active_category  = WebJournalCategory::where('status',true)->get();
        $journal          = Journal::orderByDesc("id")->get();
        $journal_active   = Journal::where('status',true)->get();
        $journal_deactive = Journal::where('status',false)->get();
---
select * from `web_journal_categories`
select * from `web_journal_categories` where `status` = 1
select * from `journals` order by `id` desc
select * from `journals` where `status` = 1
select * from `journals` where `status` = 0

    public function footerUpdate(Request $request,$slug) {
        $slug      = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $section   = SiteSections::where('key',$slug)->first();
---
select * from `site_sections` where `key` = 'footer-section' limit 1

            $data['footer']['image']  = $this->imageValidate($request,"image",$section->value->footer->image ?? null);
        }
        try{
            SiteSections::updateOrCreate(['key' => $slug],[
                'key'   => $slug,
                'value' => $data,
            ]);
---
select * from `site_sections` where (`key` = 'footer-section') limit 1

    public function appDownloadUpdate(Request $request,$slug){
        $basic_field_name = [
            'title'       => 'required|string|max:100',
            'heading'     => 'required|string|max:255',
            'sub_heading' => "required|string",
        ];

        $slug          = Str::slug(SiteSectionConst::APP_DOWNLOAD_SECTION);
        $section       = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'app-download-section' limit 1

        $update_data['key']   = $slug;
        $update_data['value'] = $data;
        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where (`key` = 'app-download-section') limit 1

    public function languages() {
        $languages = Language::whereNot('code',LanguageConst::NOT_REMOVABLE)->select("code","name")->get()->toArray();
---
select `code`, `name` from `languages` where not `code` = 'en'