app/Http/Controllers/Admin/SetupEmailController.php

    public function configuration() {
        $page_title = "Email Method";
        $email_config = BasicSettings::first()->mail_config;
---
select * from `basic_settings` limit 1