app/Http/Controllers/Admin/TrxSettingsController.php

select * from `transaction_settings`
---
    public function index()
    {
        $page_title = "Fees & Charges";
        $transaction_charges = TransactionSetting::all();

select * from `transaction_settings` where `slug` = 'bank-transfer' limit 1
---
    public function trxChargeUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'slug'                              => 'required|string',
            'feature_text'                      => 'required|string',
            $request->slug.'_fixed_charge'      => 'required|numeric',
            $request->slug.'_percent_charge'    => 'required|numeric',
            $request->slug.'_min_limit'         => 'required|numeric',
            $request->slug.'_max_limit'         => 'required|numeric',
            $request->slug.'_daily_limit'       => 'required|numeric',
            $request->slug.'_monthly_limit'     => 'required|numeric',
            $request->slug.'_com_min_limit'     => 'array',
            $request->slug.'_com_min_limit.*'   => 'required|numeric',
            $request->slug.'_com_max_limit'     => 'array',
            $request->slug.'_com_max_limit.*'   => 'required|numeric',
            $request->slug.'_fixed'             => 'array',
            $request->slug.'_fixed.*'           => 'required|numeric',
            $request->slug.'_percent'           => 'array',
            $request->slug.'_percent.*'         => 'required|numeric',
        ]);
        if( $validator->fails()){
            return back()->withErrors( $validator)->withInput();
        }
        $validated = $validator->validate();
        $transaction_setting = TransactionSetting::where('slug',$request->slug)->first();

update `transaction_settings` set `daily_limit` = '50000.0000000000000000', `transaction_settings`.`updated_at` = '2023-10-19 10:09:37' where `id` = 1
---
        $validated['intervals'] =  $input_fields;
        $validated = Arr::except($validated,['com_min_limit','com_max_limit','fixed','percent']);
        try{
            $transaction_setting->update($validated);