app/Http/Controllers/Admin/UsefulLinkController.php

    public function edit($slug){
        $page_title    = "Edit Useful Link";
        $useful_link  = UsefulLink::where('slug',$slug)->first();
        if(!$useful_link) return back()->with(['error' => ['Link not found!']]);
        $languages = Language::get();
---
select * from `useful_links` where `slug` = 'privacy-policy' limit 1
select * from `languages`

    public function update(Request $request,$slug){
        $useful_link = UsefulLink::where('slug',$slug)->first();
---
select * from `useful_links` where `slug` = 'privacy-policy' limit 1

    public function contentValidate($request,$basic_field_name,$modal = null) {
        $languages = Language::get();
---
select * from `languages`